IDEA StatiCa Open Model
ReinfFabric.MasterComponent Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Master component of reinforcement, if null, fabric reinforcement is in all components
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement MasterComponent { get; set; }
Public Property MasterComponent As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ MasterComponent {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
ReinfFabric Class
IdeaRS.OpenModel.Detail Namespace